###################################################################

# Created by write_sdc on Tue Jan 26 19:47:22 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_load -pin_load 0.5 [get_ports clkdiv]
set_load -min -pin_load 0.0005 [get_ports clkdiv]
create_clock [get_ports clk]  -name CLK  -period 1  -waveform {0 0.5}
group_path -name input_group  -from [list [get_ports clk] [get_ports rst_n] [get_ports {div[15]}]           \
[get_ports {div[14]}] [get_ports {div[13]}] [get_ports {div[12]}] [get_ports   \
{div[11]}] [get_ports {div[10]}] [get_ports {div[9]}] [get_ports {div[8]}]     \
[get_ports {div[7]}] [get_ports {div[6]}] [get_ports {div[5]}] [get_ports      \
{div[4]}] [get_ports {div[3]}] [get_ports {div[2]}] [get_ports {div[1]}]       \
[get_ports {div[0]}]]
group_path -name output_group  -to [get_ports clkdiv]
set_input_delay -clock CLK  -max 0.5  [get_ports rst_n]
set_input_delay -clock CLK  -min 0  [get_ports rst_n]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[15]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[15]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[14]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[14]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[13]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[12]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[11]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[10]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[9]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[8]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[7]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[6]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[5]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[4]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {div[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {div[0]}]
set_output_delay -clock CLK  0.5  [get_ports clkdiv]
set_input_transition -max 0.5  [get_ports rst_n]
set_input_transition -min 0  [get_ports rst_n]
set_input_transition -max 0.5  [get_ports {div[15]}]
set_input_transition -min 0  [get_ports {div[15]}]
set_input_transition -max 0.5  [get_ports {div[14]}]
set_input_transition -min 0  [get_ports {div[14]}]
set_input_transition -max 0.5  [get_ports {div[13]}]
set_input_transition -min 0  [get_ports {div[13]}]
set_input_transition -max 0.5  [get_ports {div[12]}]
set_input_transition -min 0  [get_ports {div[12]}]
set_input_transition -max 0.5  [get_ports {div[11]}]
set_input_transition -min 0  [get_ports {div[11]}]
set_input_transition -max 0.5  [get_ports {div[10]}]
set_input_transition -min 0  [get_ports {div[10]}]
set_input_transition -max 0.5  [get_ports {div[9]}]
set_input_transition -min 0  [get_ports {div[9]}]
set_input_transition -max 0.5  [get_ports {div[8]}]
set_input_transition -min 0  [get_ports {div[8]}]
set_input_transition -max 0.5  [get_ports {div[7]}]
set_input_transition -min 0  [get_ports {div[7]}]
set_input_transition -max 0.5  [get_ports {div[6]}]
set_input_transition -min 0  [get_ports {div[6]}]
set_input_transition -max 0.5  [get_ports {div[5]}]
set_input_transition -min 0  [get_ports {div[5]}]
set_input_transition -max 0.5  [get_ports {div[4]}]
set_input_transition -min 0  [get_ports {div[4]}]
set_input_transition -max 0.5  [get_ports {div[3]}]
set_input_transition -min 0  [get_ports {div[3]}]
set_input_transition -max 0.5  [get_ports {div[2]}]
set_input_transition -min 0  [get_ports {div[2]}]
set_input_transition -max 0.5  [get_ports {div[1]}]
set_input_transition -min 0  [get_ports {div[1]}]
set_input_transition -max 0.5  [get_ports {div[0]}]
set_input_transition -min 0  [get_ports {div[0]}]
